---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.CircleLightShape
source: html/13c29d5d-41b3-e3cf-a54b-31154193814f.htm
---
# CircleLightShape Methods

Creates a copy of the LightShape derived object.